HELOO= "سلام 👋 خوش آمدید!"
CHOOSE_ACTION = "لطفا یکی از گزینه‌های زیر را انتخاب کنید:"
ASK_ROLE = "لطفا نقش خود را انتخاب کنید:"
ROLE_TEACHER = "👨‍🏫 معلم"
ROLE_STUDENT = "👩‍🎓 دانش‌آموز"

ASK_FIRSTNAME = "لطفا نام خود را وارد کنید:"
ASK_LASTNAME = "لطفا نام خانوادگی خود را وارد کنید:"
ASK_GRADE = "لطفا مقطع تحصیلی را انتخاب کنید:"
GRADE_7 = "پایه هفتم"
GRADE_8 = "پایه هشتم"
GRADE_9 = "پایه نهم"

ASK_SUBJECT = "لطفا درس خود را انتخاب کنید:"
SUBJECT_MATH = "ریاضی"
SUBJECT_SCIENCE = "علوم"
SUBJECT_FARSI = "فارسی"
SUBJECT_HISTORY = "تاریخ"

ASK_PASSWORD = "لطفا یک پسورد برای حساب خود انتخاب کنید:"
REGISTRATION_SUCCESS = "✅ ثبت‌نام شما با موفقیت انجام شد!\nآیدی شما: {user_id}"

ASK_LOGIN_ID = "لطفا آیدی عددی 5 یا 4 رقمی خود را وارد کنید:"
ASK_LOGIN_PASSWORD = "لطفا پسورد خود را وارد کنید:"
ENTER_ID_PASSWORD_WRONG= "⚠️ لطفا نام کاربری یا رمز عبور را به درستی وارد کنید. برای اینکار از قسمت منو ربات را دوباره استارت کنید."
LOGIN_SUCCESS = "✅ ورود موفقیت‌آمیز بود. خوش آمدید!"
LOGIN_FAIL = "⚠️ آیدی یا پسورد اشتباه است."

TEACHER_MENU = "📚 چه کاری می‌خواهید انجام دهید؟"
NEW_EXAM_BTN = "🆕 ساخت آزمون جدید"
QUESTION_BANK_BTN = "📂 بانک سوالات"

CHOOSE_QUESTION_TYPE = "❓ چه نوع سوالی می‌خواهید طرح کنید؟"
QUESTION_TYPE_TESTI = "🔘 تستی"
QUESTION_TYPE_BLANK = "✏️ جاخالی"
QUESTION_TYPE_YESNO = "✅❌ بله/خیر"

ASK_QUESTION_TEXT = "❓ لطفا سوال خود را وارد کنید:"
ASK_OPTION_1 = "➊ لطفا گزینه اول را وارد کنید:"
ASK_OPTION_2 = "➋ لطفا گزینه دوم را وارد کنید:"
ASK_OPTION_3 = "➌ لطفا گزینه سوم را وارد کنید:"
ASK_OPTION_4 = "➍ لطفا گزینه چهارم را وارد کنید:"
ASK_CORRECT_OPTION = "✅ کدام گزینه صحیح است؟ (عدد 1 تا 4 را وارد کنید)"
YES= "✅ بله"
NO= "❌ خیر"

ASK_CORRECT_ANSWER = "✅ لطفا پاسخ صحیح سوال را وارد کنید:"
ASK_DIFFICULTY = "⚖️ درجه سختی سوال را انتخاب کنید:"
DIFFICULTY_EASY = "آسان"
DIFFICULTY_MEDIUM = "متوسط"
DIFFICULTY_HARD = "دشوار"

ASK_SCORE = "📊 بارم سوال را وارد کنید (عدد):"
QUESTION_ADDED = "✅ سوال شما با موفقیت اضافه شد."
ANOTHER_OR_END = "می‌خواهید سوال دیگری اضافه کنید یا آزمون را پایان دهید؟"
ADD_ANOTHER_BTN = "➕ سوال دیگر"
FINISH_EXAM_BTN = "🏁 پایان آزمون"

ASK_DURATION = "⏱️ مدت زمان آزمون را (به دقیقه) وارد کنید:"
EXAM_CREATED = "✅ آزمون شما ساخته شد.\nکد آزمون: {exam_code}"

STUDENT_MENU = "🎓 لطفا یکی از گزینه‌های زیر را انتخاب کنید:"
CHOOSE_BITWEEN= "لطفاً از بین گزینه‌ها انتخاب کنید."
STUDENT_TAKE_EXAM = "📝 شرکت در آزمون"
STUDENT_RESULTS = "📊 دیدن نتایج"

ASK_EXAM_CODE = "🔑 لطفا کد آزمون را وارد کنید:"
EXAM_NOT_FOUND = "⚠️ آزمون پیدا نشد."
EXAM_STARTED = "⏱️ آزمون آغاز شد! لطفا به سوالات پاسخ دهید."

ANSWER_PROMPT = "❓ پاسخ خود را وارد کنید:"
EXAM_FINISHED = "✅ آزمون شما پایان یافت. نمره شما: {score}"

RESULTS_HEADER = "📊 نتایج شما:"
RESULT_LINE = "آزمون {exam_code} - نمره: {score} - رتبه: {rank}"

STUDENT_QUESTION_BANK = "📚 بانک سوالات"
STUDENT_TAKE_ANOTHER_EXAM = "🔄 شرکت در آزمون دیگر"

DONT_UNDERSTAND = "منظور شما را متوجه نمیشم🥲"

ENTER_FIRST = "ابتدا باید وارد شوید."
CANT_FIND_TEACHER= " شناسه معلم یافت نشد."
DONT_FIGUR= " وضعیت نامشخص است."
CANT_FIND_INFO= "اطلاعات معلم یافت نشد."
CANT_FIND_QUESTION = "هیچ سوالی یافت نشد."
CANT_FIND_STUDENT= " شناسه دانش‌آموز یافت نشد."
YOU_EXAMED_BEFOR= "❌ شما قبلاً در این آزمون شرکت کرده‌اید."
CHOOSE_BITWEEN_YES_OR_NO= "لطفاً فقط یکی از دو گزینه 'بله' یا 'خیر' را انتخاب کنید."

